Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན། འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་པ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེ་བ་མ་ཡིན་གྱི།
en: “The bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the entire ocean of the conduct of all beings within one world realm and so on up to the bodhisattvas do not develop the aspiration for enlightenment in order to comprehend the entire ocean of the conduct of all beings within world realms as numerous as the atoms in an anabhilāpyānabhilāpya­parivarta of world realms.

source: སེམས་ཅན་གྱི་ཁམས་མ་ལུས་པ་ལྷག་མ་མེད་པ་མཐའ་དག་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེའོ། །
en: “The bodhisattvas develop the aspiration for enlightenment in order to guide and ripen the beings throughout the entirety of all world realms without exception or remainder.

source: སངས་རྒྱས་མ་ལུས་པ་ཐམས་ཅད་བསྙེན་བཀུར་ཞིང་མཉེས་པར་བྱ་བ་དང་། མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བྱང་ཆུབ་ཏུ་སྐྱེའོ། །
en: “The bodhisattvas develop the aspiration for enlightenment in order to serve, propitiate, make offerings to, and honor all buddhas without remainder.

source: འཇིག་རྟེན་གྱི་ཁམས་མ་ལུས་པ་ཐམས་ཅད་དུ་གཏོགས་པའི་སངས་རྒྱས་ཀྱི་རྒྱུད་བསྙེན་བཀུར་ཞིང་མཉེས་པར་བྱ་བ་དང་། མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྨོན་ལམ་ལ་མངོན་པར་མོས་པ་ཡིན།
en: “The bodhisattvas make the prayer to serve, propitiate, make offerings to, and honor the succession of buddhas within all world realms without remainder.

source: སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་པ་བརྟན་པར་འགྱུར་བ་ཡིན།
en: “The bodhisattvas have the firm intention to purify all buddha realms without remainder.

source: སངས་རྒྱས་ཀྱི་བསྟན་པ་མ་ལུས་པ་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱོར་བ་འབྱུང་བ་ཡིན།
en: “The bodhisattvas are dedicated to holding the teachings of all tathāgatas without remainder.

source: དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཞུགས་པའི་སྨོན་ལམ་རྣམ་པ་ཐ་དད་པ་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་ཀྱི་ཤུགས་དྲག་པོ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas have the strength of mind to comprehend the different prayers established by all buddhas without remainder.

source: དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་མ་ལུས་པ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡི་དམ་བརྟན་པ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas are resolved to enter the displays of the qualities of all buddha realms without remainder.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་མ་ལུས་པ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་མོས་པ་འབྱུང་བ་ཡིན།
en: “The bodhisattvas develop aspiration in order to enter the circle of followers of all buddhas without remainder.

source: འགྲོ་བའི་སེམས་རྒྱ་མཚོ་མ་ལུས་པ་ཐམས་ཅད་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྨོན་ལམ་ཡོངས་སུ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas pray to comprehend the oceans of the minds of all beings without remainder.

source: སེམས་ཅན་གྱི་དབང་པོའི་འཁོར་ལོ་མ་ལུས་པ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་འདོད་པ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas long to comprehend the wheels of faculties of all beings without remainder.

source: སེམས་ཅན་གྱི་དབང་པོ་རྒྱ་མཚོ་མ་ལུས་པ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྲོ་བ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas are enthused to comprehend the oceans of faculties of all beings without remainder.

source: འཇིག་རྟེན་གྱི་ཁམས་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་བསྐལ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མོས་པ་སྐྱེ་བ་ཡིན།
en: “The bodhisattvas aspire to comprehend the succession of kalpas in all world realms without remainder.

source: སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཡོངས་སུ་གཅད་པའི་ཕྱིར།
en: “The bodhisattvas have the determination to eradicate the ocean of kleśas of all beings without remainder.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཡོངས་སུ་སྐྱེ་བ་ཡིན། སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་ལས་དང་ཉོན་མོངས་པའི་རྒྱ་མཚོ་བསྐམ་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཆེན་པོའི་ཉི་མ་འཆར་བ་ཡིན།
en: “The bodhisattvas have the rising of the sun of great knowledge in order to dry up the ocean of the karma and kleśas of all beings without remainder.

source: སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་སྣང་བ་འབྱུང་བ་ཡིན།
en: “The bodhisattvas develop the radiance of wisdom in order to know the conduct of all beings without remainder.

source: སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་མེའི་ཕུང་པོ་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེའི་སྤྲིན་ཆེན་པོ་ཀུན་ནས་འདུ་བ་ཡིན།
en: “The bodhisattvas gather the clouds of great compassion in order to end the mass of suffering of all beings without remainder.

source: རིགས་ཀྱི་བུ་མདོར་ན་དེ་དག་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཚུལ་དང་། སྒོ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ། །
en: “Noble one, in brief, the bodhisattvas accomplish these and millions of countless other ways and gateways of bodhisattva conduct.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ནི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར། ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའོ། །
en: “Moreover, noble one, bodhisattva conduct is the acquisition of all Dharmas in order to realize wisdom.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ནི་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཞིང་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའོ། །
en: Bodhisattva conduct is the acquisition of all realms in order to accomplish their purification.

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན། ཁོ་མོས་ནི་བདག་གི་སྨོན་ལམ་ནམ་མཁའི་དབྱིངས་རྣམ་པར་དག་པའི་མཐའ་གང་དུ་ཐུག་པ་དེའི་མཐས་ཀླས་པར་ཤོག་ཤིག །
en: “Therefore, noble one, may my prayers reach their conclusion only when the realm of desire has been completely purified.

source: བདག་གི་སྨོན་ལམ་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དག་པའི་མཐའ་གང་དུ་ཐུག་པ་དེའི་མཐས་ཀླས་པར་ཤོག་ཤིག །
en: May my prayers reach their conclusion only when the world realms are purified.

source: བདག་གི་སྨོན་ལམ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་དང་། བག་ལ་ཉལ་བའི་མཐའ་གང་དུ་ཐུག་པ་དེའི་མཐས་ཀླས་པར་ཤོག་ཤིག །ཅེས་དེ་ལྟར་སྨོན་ལམ་བཏབ་བོ། །
en: May my prayers reach their conclusion only when their connection with the predispositions and propensities for the kleśas of all beings have come to an end.”

source: སྨྲས་པ། འཕགས་མ་རྣམ་པར་ཐར་པ་འདིའི་མིང་ཅི་ཞེས་བགྱི།
en: Sudhana asked, “Āryā, what is the name of this liberation?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་རྣམ་པར་ཐར་པ་འདི་ནི་ཉོན་མོངས་པ་མེད་པ་བདེ་བའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་སྟེ།
en: Āśā replied, “Noble one, this liberation is called the banner of bliss without sorrow.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དེ་གཅིག་པུ་ཤེས་པར་ཟད་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འཛིན་པའི་ཕྱིར། སེམས་རྒྱ་མཚོ་དང་ལྡན་པ་ལྷག་པའི་བསམ་པ་བརྟན་པའི་ཕྱིར་རི་རབ་དང་འདྲ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་ནད་རབ་ཏུ་སོས་པར་བྱེད་པའི་ཕྱིར་སྨན་གྱི་རྒྱལ་པོ་མཐོང་ན་ལེགས་པ་ལྟ་བུ།
en: “Noble one, I know only this bodhisattva liberation.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་རིག་པའི་མུན་པ་སེལ་བའི་ཕྱིར་ཉི་མར་གྱུར་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པའི་གནས་སུ་གྱུར་པས་ས་ལྟ་བུའི་སེམས་དང་ལྡན་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་བྱེད་པའི་ཕྱིར་རླུང་དུ་གྱུར་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཀྱི་སྣང་བ་འབྱིན་པའི་ཕྱིར་མར་མེར་གྱུར་པ། ཞི་བའི་སྒྲས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཆར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་འབེབས་པའི་ཕྱིར་སྤྲིན་དུ་གྱུར་པ་བསོད་ནམས་ཀྱི་འོད་གཟེར་གྱི་དྲ་བ་རབ་ཏུ་འགྱེད་པའི་ཕྱིར་ཟླ་བ་ལྟ་བུ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བ་ལ་ཞུགས་པའི་ཕྱིར། བརྒྱ་བྱིན་ལྟ་བུ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know or describe the qualities of the conduct of bodhisattvas who have minds like an ocean because they have received all the Buddhadharma, who are like Mount Meru because of their firm commitment, who are like beautiful kings of healing because they free all beings from the illness of the kleśas, who are like the sun because they dispel the darkness of ignorance for all beings, who have minds that are like the earth because they support the aspirations of all beings, who are like the air because they benefit all beings, who are like lamps because they bring the light of knowledge to all beings, who are like clouds because they send down with peaceful sounds a rain of the Buddhadharma, who are like the moon because they emit a network of light rays of merit, and who are like Śakra because they are dedicated to the protection of all beings?

source: ཡོན་ཏན་བརྗོད་པའམ། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་སྨོས་པའམ།
en: How could I speak of their inconceivable bodhisattva training?

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་རྣམ་པ་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་བསྟན་པར་ནུས་རེ་སྐན། །
en: How could I teach the forms of their bodhisattva prayers?

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་རྒྱ་མཚོ་རྣམ་པར་རློབ་པ་འདི་ན་ཡུལ་ཆུ་བ་གཙང་མ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Depart, noble one. In this southern region, in this Samudravetāḍī, there is a land called Nālayu.

source: དེ་ན་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཤེས་བྱ་བ་འདུག་གི་དེའི་གན་དུ་སོང་ལ་དྲིས་ཤིག་དང་།
en: There dwells a ṛṣi by the name of Bhīṣmottara­nirghoṣa. “Go to him and ask him.

source: དེས་རིགས་ཀྱི་བུ་ཁྱོད་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྟོན་པར་འགྱུར་རོ། །
en: Noble one, he will teach you the bodhisattva conduct.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་ཡིད་བཞིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་བསྙེན་མ་ཡིད་བཞིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ་ཕྱག་འཚལ་ནས།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the upāsikā Āśā and circumambulated the upāsikā Āśā, keeping her to his right, a hundred thousand times.

source: ངོ་མཆི་མས་གང་བར་ངུས་ཏེ། བྱང་ཆུབ་མཆོག་ཏུ་དཀོན་པ་རྗེས་སུ་སེམས་ཤིང་དགེ་བའི་བཤེས་གཉེན་རིམ་གྲོར་བྱ་བ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། སྐྱེས་བུ་དམ་པ་དང་འཕྲད་པ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་འཐོབ་པར་བྱ་བ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཡོངས་སུ་དག་པ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། སྐལ་བ་མཉམ་པའི་དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་པ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་ཏུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་མོས་ཤིང་སེམས་ངེས་པར་གཞོག་པ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། མི་མཉམ་པ་མེད་པའི་ཆོས་ཀྱི་ཚུལ་རྗེས་སུ་བསྟན་པའི་སྦྱོར་བ་དཀོན་པ་རྗེས་སུ་བསམ་པ་དང་། སེམས་དྲི་མ་མེད་ཅིང་མི་འཕྲོགས་པའི་སྦྱོར་བ་ཡང་དག་པར་བསྒྲུབ་པར་དཀའ་བ་རྗེས་སུ་བསམ་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཤུགས་དྲག་པོ་རྣམ་པར་བསྐྱེད་པའི་ཆོས་ཀྱི་སྣང་བ་དཀོན་པ་རྗེས་སུ་བསམ་པ་བྱེད་ཅིང་། དགེ་བསྙེན་མ་ཡིད་བཞིན་གྱི་དྲུང་ནས་སོང་ངོ་། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་གདམས་ངག་གི་རྗེས་སུ་སོང་བའི་སེམས་དང་ལྡན་པ།
en: Looking back again and again, bowing, his face covered with tears, thinking of the rarity of the highest enlightenment, thinking of the rarity of being able to honor a kalyāṇamitra, thinking of the rarity of meeting a superior being, thinking of the rarity of attaining the faculties of a bodhisattva, thinking of the rarity of attaining the pure motivation of a bodhisattva, thinking of the rarity of meeting suitable companions, thinking of the rarity of having in mind the true aspiration for enlightenment, thinking of the rarity of practicing the teaching of the unequaled Dharma, thinking of the rarity of the practice of an unwavering and stainless mind, and thinking of the rarity of the light of the Dharma that creates the power of omniscience, he departed from the presence of the upāsikā Āśā.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱེད་པའི་རྗེས་སུ་སོང་བའི་སེམས་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་ཀྱི་སྟོབས་རྣམ་པར་འཕེལ་བར་བྱ་བའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་བལྟ་བའི་ཤུགས་དྲག་པོས་རབ་ཏུ་སྣང་བར་བྱ་བའི་སེམས་དང་ལྡན་པ། ཆོས་ཀྱི་གཏེར་འཐོབ་པར་བྱ་བ་ལ་ཤུགས་དྲག་པོ་སྐྱེས་པའི་སེམས་དང་ལྡན་པ། སྨོན་ལམ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པའི་ཤུགས་དྲག་པོ་རབ་ཏུ་འཕེལ་བའི་སེམས་དང་ལྡན་པ་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱོགས་ལ་མངོན་དུ་ལྟ་བའི་སེམས་དང་ལྡན་པ། ཆོས་ཀྱི་རང་བཞིན་གྱི་འོད་ཀྱིས་སྣང་བར་བྱས་པའི་སེམས་དང་ལྡན་པ། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་འཐོར་བའི་སེམས་དང་ལྡན་པ།
en: Bhīṣmottara­nirghoṣa Chapter 11 Then Sudhana, the head merchant’s son, thinking of following the bodhisattva instructions, thinking of following the pure conduct of bodhisattvas, thinking of increasing the strength of the merit of bodhisattvas, thinking of the illumination of the power of seeing the buddhas, thinking of developing the power to attain the treasure of the Dharma, thinking of increasing the power of accomplishing the great prayers, thinking of facing every direction in the realm of the Dharma, thinking of the illumination of the nature of the Dharma, thinking of the dispersal of all obscurations, thinking of looking at the realm of Dharma free of darkness, thinking of the motivation that is stainless and unbreakable like Nārāyaṇa’s precious vajra, and thinking of invincibility and unassailability in the face of all the māra armies, eventually arrived in the land of Nālayu.

source: ཆོས་ཀྱི་དབྱིངས་ལ་མུན་པ་མེད་པར་རྣམ་པར་ལྟ་བའི་སེམས་དང་ལྡན་པ། རྡོ་རྗེ་རིན་པོ་ཆེ་མཐུ་བོ་ཆེས་མྱི་ཆོམས་པ་ལྟར་དྲི་མ་མེད་པའི་སེམས་དང་ལྡན་པ། བདུད་ཐམས་ཅད་ཀྱི་དཔུང་གིས་བརྒལ་བར་དཀའ་ཞིང་ཐུབ་པར་དཀའ་བའི་སེམས་དང་ལྡན་པ་དེ་མཐར་གྱིས་ཡུལ་ཆུ་བ་གཙང་མ་ག་ལ་བ་དེར་ཕྱིན་ནས།
en: He searched and searched for the ṛṣi Bhīṣmottara­nirghoṣa.

source: དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཚོལ་ཚོལ་བ་ལས། དེའི་ཚེ་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་དགེ་བ་སྦྱང་བའི་གནས་ཤིང་དང་། ཤིང་ཕྲན་སྣ་ཚོགས་གྲངས་མེད་པའི་ནགས་ཚལ་མདངས་དགའ་བ།
en: At that time, the ṛṣi Bhīṣmottara­nirghoṣa was dwelling in an ashram in a delightful forest of countless different kinds of trees and creepers.

source: ལོ་མས་རྒྱས་པའི་ཤིང་གིས་ཀུན་ནས་འགྲིགས་པ། རྟག་ཏུ་མེ་ཏོག་རྒྱས་པ་དང་ལྡན་པའི་ཤིང་སྣ་ཚོགས་ཅན། རྟག་ཏུ་ཤིང་ཏོག་མང་པོ་དང་ལྡན་པའི་ཤིང་ཏོག་གི་ཤིང་དང་ལྡན་པ།
en: In that forest there was a canopy of the leaves of various trees, there were always flowers blossoming on trees of various kinds, and there were fruit trees always laden with fruit.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་དྲུང་ནོར་བུ་རིན་པོ་ཆེའི་སྤང་ལེབ་ཀྱིས་རྟག་ཏུ་གཤིབས་པ་དང་ལྡན་པ།
en: Platforms of precious fruit had formed at the feet of trees that were made of the various kinds of precious materials.

source: ཙན་དན་དམ་པའི་ཤིང་ཀུན་ནས་རྣམ་པར་བྲེས་པ།
en: There were beautifully proportioned tall sandalwood trees.

source: ཨ་གུ་རུ་ཡིད་དུ་འོང་བའི་ཤིང་ལས་སྤོས་ཀྱི་དྲི་རྟག་ཏུ་འབྱུང་བས་རབ་ཏུ་བརྒྱན་པ།
en: The forest was made pleasant by the aroma that constantly came from beautiful agarwood trees.

source: ཕྱོགས་བཞི་ནས་ཤིང་བ་ཏ་ལ་རྣམ་པར་མཛེས་པར་སྐྱེས་པས་ཡོངས་སུ་བརྒྱན་པ།
en: It was beautified by scents in all four directions. It was adorned by perfectly proportioned bignonia trees.

source: ནྱ་གྲོ་དའི་ཤིང་དབྱིབས་ཡིད་དུ་འོང་བ་དང་ལྡན་པ།
en: There were beautifully formed banyan trees.

source: འཛམ་བུའི་ཤིང་ལས་རྟག་ཏུ་ཤིང་ཏོག་སྨིན་པ་འབྲུལ་བ།
en: Ripened fruits were constantly falling from jambul trees.

source: མེ་ཏོག་གི་ཚལ་པདྨོ་དང་ཨུཏ་པ་ལ་གསར་དུ་སྐྱེས་པས་རབ་ཏུ་བརྒྱན་པ་ཞིག་ན་འདུག་འདུག་སྟེ།
en: It was beautified by fresh red lotuses, blue lotuses, and night lotuses.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་དྲང་སྲོང་སྟོང་ཕྲག་བཅུས་བསྐོར་ཅིང་།
en: Sudhana saw the ṛṣi Bhīṣmottara­nirghoṣa and circumambulated the ṛṣi Bhīṣmottara­nirghoṣa a hundred thousand times, keeping him to his right.

source: ཙན་དན་གྱི་ཡལ་ག་ཤིན་ཏུ་འབྲེལ་བའི་བྱ་སྐྱིབས་ཤིག་ན།
en: The ṛṣi Bhīṣmottara­nirghoṣa was seated under a canopy of interlaced sandalwood branches.

source: ཐོར་ཚུགས་ཀྱི་ཅོད་པན་ཅན། པགས་པ་དང་། རྩའི་གོས་གྱོན་པ། ཤིང་ཤུན་གྱི་སྨད་ཡོགས་ཅན་རྩའི་སྟན་ལ་འདུག་པ་མཐོང་ངོ་། །
en: His hair was bound into a topknot of matted locks, he wore clothing made of skins and grass, with a skirt of bark, and he was seated on a cushion of grass.

source: མཐོང་ནས་ཀྱང་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ག་ལ་བ་དེར་སོང་སྟེ། ཕྱིན་ནས་ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་པའི་བསམ་པས་དགེ་བའི་བཤེས་གཉེན་ནི་ཡང་དག་པའི་ལམ་སྟོན་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་འབྱུང་བའི་སྒོ་ཡིན་པར་ཡང་དག་པར་ལྟ། ཐམས་ཅད་མཁྱེན་པའི་ས་ལ་གཞོག་པས།
en: Sudhana approached the ṛṣi Bhīṣmottara­nirghoṣa.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་རག་ལུས་པར་ཡང་དག་པར་ལྟ། སྟོབས་བཅུའི་ཡེ་ཤེས་རིན་པོ་ཆེའི་གླིང་དུ་སྐྱེལ་བས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་མཉན་པ་ལ་རག་ལུས་པར་ཡང་དག་པར་ལྟ། སྟོབས་བཅུའི་ཡེ་ཤེས་སྣང་བ་ཡང་དག་པར་བསྐྱེད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་སྒྲོན་མས་སྣང་བར་བྱ་བ་ཡིན་པར་ཡང་དག་པར་ལྟ། ཉམ་ཉེས་མེད་པར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་དུ་ཕྱིན་པར་བྱེད་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ། མཉམ་པ་དང་མི་མཉམ་པ་ཡོངས་སུ་སྟོན་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མར་མེ་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ། གཡང་སའི་འཇིགས་པ་ཐམས་ཅད་མེད་པར་བྱེད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྟེགས་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ། བྱམས་པ་ཆེན་པོའི་སྟོབས་ཀྱིས་སིམ་པ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གདུགས་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་བསྐྱེད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་དྲག་པོ་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ་ཞིང་ཆོས་ཀྱི་རང་བཞིན་གྱི་ཚུལ་རབ་ཏུ་སྣང་བར་བྱེད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གསལ་བར་མཐོང་བ་ནི།
en: When he had approached him, seeing that omniscience arises from the gateway of the kalyāṇamitra, the genuine kalyāṇamitra that one wishes to find, because the kalyāṇamitra teaches the true path; seeing that omniscience is dependent on the instructions of the kalyāṇamitra because they lead one to the level of omniscience; seeing that omniscience is dependent on the friendship of the kalyāṇamitra because they lead one to the island of the jewels of the wisdom of the ten strengths; seeing that omniscience is the illumination from the lamp of the kalyāṇamitra because they create the light of the wisdom of the ten strengths; seeing that the kalyāṇamitra is the road to omniscience because they lead one to the city of unimpaired omniscience, seeing that omniscience is the lamp of the kalyāṇamitra because they reveal that which is equal and unequal; seeing that the kalyāṇamitra is the bridge of omniscience because they eliminate all the fear of falling into crevasses; seeing that the kalyāṇamitra is the parasol of omniscience because they cool through the power of great benevolence; seeing that the kalyāṇamitra is the power of omniscience because they create great compassion; and seeing that reliance on the kalyāṇamitra is the clear vision of omniscience because they illuminate the way of the nature of phenomena, Sudhana threw his body onto the ground before him, prostrating to him.

source: དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལས་པར་མཐོང་ནས། ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ། ཕྱག་བྱས་ནས་ལངས་ཏེ། དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ།
en: He then rose, circumambulated the ṛṣi Bhīṣmottara­nirghoṣa many hundreds of thousands of times, keeping him to his right, and then sat down before him.

source: ཐལ་མོ་སྦྱར་ནས་ཡིད་དུ་འོང་བའི་ཚུལ་གྱིས་ཡིད་དུ་འོང་བའི་ཚིག་བརྗོད་དེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: With his hands together in homage in a pleasing way with pleasing words, he said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་།
en: How does a bodhisattva train in bodhisattva conduct?

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: How does a bodhisattva practice it?

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་ཐོས་ན།
en: “Ārya, I have heard that you teach and give instructions to bodhisattvas.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ།
en: Therefore, Ārya, teach me how bodhisattvas train in bodhisattva conduct and in what way they practice it!”

source: དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་བྲམ་ཟེའི་བྱིས་པ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་ལ་བལྟས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་དག་རིགས་ཀྱི་བུ་འདིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: The ṛṣi Bhīṣmottara­nirghoṣa looked at the ten thousand brahmin youths who were there and said, “Young men, this noble one has developed the aspiration for the highest, complete enlightenment.

source: སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་མེད་པ་ལ་མགྲོན་དུ་གཉེར་ཏོ། །
en: He has invited all beings to become free of fear.

source: རིགས་ཀྱི་བུ་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་དོན་དུ་སྟ་གོན་དུ་གནས་པ་སྟེ།
en: This noble one is prepared to bring happiness and benefit to all beings.

source: ཡེ་ཤེས་རྒྱ་མཚོ་ལ་མངོན་དུ་གྱུར་པའོ། །
en: He is facing an ocean of wisdom.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་བཏུང་བར་འདོད་པའོ། །
en: He longs to drink the rain of the clouds of Dharma of all the tathāgatas.

source: ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པར་འདོད་པའོ། །
en: He longs to enter the ocean of all the ways of the Dharma.

source: ཡེ་ཤེས་ཀྱི་སྣང་བ་ཆེན་པོ་ལ་གནས་པར་འདོད་པའོ། །
en: He longs to be in the great light of wisdom.

source: སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་བསྡུ་བར་འདོད་པའོ། །ཆོས་ཀྱི་ཆར་ཆེན་པོ་མངོན་པར་དབབ་པར་འདོད་པའོ། །
en: He longs for the great rain of the Dharma to fall.

source: ཡེ་ཤེས་ཆེན་པོའི་ཟླ་བ་འཇིག་རྟེན་དུ་ཤར་བར་བྱས་ཏེ། ཉོན་མོངས་པའི་གདུང་བ་ཐམས་ཅད་རབ་ཏུ་གཞིལ་བར་འདོད་པའོ། །
en: He longs for the moon of great wisdom to rise over the world and extinguish all the torment of the kleśas.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་རྣམ་པར་སྤེལ་བར་འདོད་པའོ། །དེ་ནས་བྲམ་ཟེའི་བྱིས་པ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་གིས་མེ་ཏོག་དྲི་ཞིམ་ལ་ཡིད་དུ་འོང་ཞིང་ཁ་དོག་སྣ་ཚོགས་དང་ལྡན་པ་མང་པོས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་གཏོར་ཏོ། །མངོན་པར་གཏོར་ཏོ། །རབ་ཏུ་གཏོར་ཏོ། །མངོན་པར་ཕྱག་འཚལ་ཏོ། །དེ་ལྟར་བཏུད་དེ་ཕྱག་འཚལ་ནས། གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཚིག་འདི་སྐད་དུ་བརྗོད་དོ། །འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པར་འགྱུར་རོ། །སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པར་འགྱུར་རོ། །བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་རྣམ་པར་གཅོད་པར་འགྱུར་རོ། །གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་རྣམ་པར་བཟློག་པར་འགྱུར་རོ། །མི་ཁོམ་པའི་སྒོ་ཐམས་ཅད་གཅོད་པར་འགྱུར་རོ། །སྲེད་པའི་རྒྱ་མཚོ་ཡོངས་སུ་སྐེམས་པར་འགྱུར་རོ། །སྲིད་པའི་འཆིང་བ་གཅོད་པར་འགྱུར་རོ། །སྡུག་བསྔལ་གྱི་ཕུང་པོ་རྣམ་པར་བཟློག་པར་འགྱུར་རོ། །
en: He longs to increase the roots of merit of all beings.”

source: མ་རིག་པའི་མུན་པ་སེལ་བར་འགྱུར་རོ། །བསོད་ནམས་ཀྱི་ཁོར་ཡུག་གིས་འཇིག་རྟེན་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ། །ཡེ་ཤེས་རིན་པོ་ཆེའི་འབྱུང་གནས་སུ་ཡོངས་སུ་སྟོན་པར་འགྱུར་རོ། །ཡེ་ཤེས་ཀྱི་ཉི་མ་འཆར་བར་བགྱིད་པར་འགྱུར་རོ། །ཆོས་ཀྱི་མིག་རྣམ་པར་སྦྱོང་བར་འགྱུར་རོ། །འཇིག་རྟེན་རྣམས་ལ་མཉམ་པ་དང་མི་མཉམ་པ་ཡང་དག་པར་སྟོན་པར་འགྱུར་རོ། །
en: Then the ten thousand brahmin youths scattered beautiful flowers with lovely aromas and in various colors over Sudhana, the head merchant’s son, strewed them over him, covered him with them, paid homage to him, bowed down to him, circumambulated him, keeping him to their right, and then said these words to him: “This one will become a protector of all beings; he will end all the sufferings in the hells, he will block all the pathways to rebirth as animals, he will turn beings away from the path that leads to the world of Yama, he will close the doors to the unfortunate existences, he will dry up the ocean of existences, he will cut through the bondage of existences, he will repel the mass of suffering, he will dispel the darkness of ignorance, he will establish a Cakravāla mountain range of merit around the world, he will reveal the source of the jewels of wisdom, he will cause the sun of wisdom to rise, he will purify the eyes of Dharma, and he will reveal that which is equal and unequal in all the worlds.”
